
{
  "name": "basic_dataset",
  "version": "0.1",
  "intents": [
    {
      "tag": "unknown",
      "patterns": [],
      "responses": [
        "I'm not sure I understand. Could you rephrase that?",
        "I didn't quite catch that. Could you elaborate?",
        "That's a bit unclear to me. Can you provide more context?"
      ]
    },
    {
      "tag": "greeting",
      "patterns": [
        "hello", "hi", "hey", "good morning", "good evening",
        "what's up", "howdy", "yo", "greetings", "nice to meet you",
        "hi there", "hey there", "hiya", "howdy-do", "salutations",
        "long time no see", "good to see you"
      ],
      "responses": [
        "Hello! How can I assist you today?",
        "Hi there! What can I help you with?",
        "Hey! I'm ready to help. What do you need?",
        "Greetings! How are you doing?",
        "Welcome! What brings you here?",
        "Nice to meet you! How can I be of service?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "bye", "goodbye", "see you", "take care", "later",
        "farewell", "see you later", "catch you later",
        "gotta go", "i'm out", "bye for now", "talk to you later",
        "until next time", "peace out", "got to run"
      ],
      "responses": [
        "Goodbye! Have a fantastic day!",
        "See you soon! Take care!",
        "Farewell! Hope I could help.",
        "Bye! Don't hesitate to return if you need anything.",
        "Take care and stay awesome!",
        "Until next time! Wishing you well."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "thanks", "thank you", "appreciate it", "many thanks",
        "thanks a lot", "thank you so much", "thx", "ty",
        "much appreciated", "you're the best", "awesome, thanks"
      ],
      "responses": [
        "You're welcome!",
        "No problem at all!",
        "Anytime!",
        "Happy to help!",
        "Glad I could assist you!",
        "It's my pleasure!",
        "Always here to help!"
      ]
    },

    {
      "tag": "help",
      "patterns": [
        "help", "i need help", "can you help me", "what help can you provide",
        "assistance", "i'm stuck", "help me out", "i don't know what to do",
        "can you guide me", "i need guidance"
      ],
      "responses": [
        "Sure, I'm here to help! What specific assistance do you need?",
        "Of course! Please tell me more about what you're looking for.",
        "I'm ready to assist you. What can I help you with today?",
        "Let's work together to solve your problem. What's on your mind?",
        "Guidance is my specialty. What do you need help with?"
      ]
    },
    {
      "tag": "compliment",
      "patterns": [
        "you're smart", "you're awesome", "great job", "you rock",
        "you're incredible", "impressive", "well done", "you're brilliant"
      ],
      "responses": [
        "Thank you! I'm designed to be helpful.",
        "I appreciate the kind words!",
        "I'm glad I could be of assistance.",
        "My goal is always to provide the best help I can.",
        "Thank you for your kind words!"
      ]
    },


    {
      "tag": "greetings_how_are_you",
      "patterns": ["how are you?", "how are you doing?", "how's it going?", "how do you feel?"],
      "responses": [
        "I'm doing great, thanks for asking! How about you?",
        "I'm functioning perfectly! How can I help you today?",
        "All systems operational and ready to assist you!",
        "I'm well! I'm always happy to be chatting with someone.",
        "I'm having a wonderful day. What can I do for you?"
      ]
    },
    {
      "tag": "activity_what_doing",
      "patterns": ["what are you doing?", "what are you up to?", "what's going on?"],
      "responses": [
        "Just waiting to help with whatever you need!",
        "I'm here chatting with you and ready to assist with any questions.",
        "Processing information and learning new things to better help users like you.",
        "Right now, my full attention is on our conversation.",
        "I'm helping people with their questions and tasks. What can I help you with?"
      ]
    },
    {
      "tag": "identity_who",
      "patterns": ["who are you?", "what are you?", "tell me about yourself"],
      "responses": [
        "I'm an AI assistant designed to be helpful, harmless, and honest in my interactions.",
        "I'm your friendly AI assistant, created to provide information and assistance on a wide range of topics.",
        "I'm an AI that enjoys helping people find information and solve problems.",
        "Think of me as a digital assistant - I'm here to answer questions and provide assistance with various tasks.",
        "I'm an AI designed to be informative and helpful. I can answer questions, write content, and assist with many different tasks."
      ]
    },
    {
      "tag": "identity_name",
      "patterns": ["what is your name?", "what should I call you?", "do you have a name?"],
      "responses": [
        "You can call me Assistant! I'm here to help you with whatever you need.",
        "I'm Assistant, your friendly AI helper!",
        "My name is Assistant. What can I help you with today?",
        "I go by Assistant. Nice to meet you!",
        "I'm Assistant - here to assist with information and tasks whenever you need."
      ]
    },
    {
      "tag": "help_request",
      "patterns": ["can you help me?", "I need help", "can you assist me?"],
      "responses": [
        "Absolutely! I'd be happy to help. What do you need assistance with?",
        "That's what I'm here for! What can I help you with?",
        "I'll certainly try my best to help. What's on your mind?",
        "Of course! Please let me know what you need help with, and I'll do my best.",
        "I'm always ready to assist. What would you like help with today?"
      ]
    },
    {
      "tag": "capabilities",
      "patterns": ["what do you do?", "what can you do?", "what are you capable of?"],
      "responses": [
        "I can answer questions, write content, summarize information, help with creative tasks, and much more!",
        "I'm designed to assist with a wide range of tasks including answering questions, writing, problem-solving, and providing information on various topics.",
        "I can help with information, writing tasks, brainstorming ideas, explaining concepts, and many other things. Just ask!",
        "My capabilities include answering questions, generating creative content, helping with research, and providing assistance across many domains of knowledge.",
        "I can assist with information retrieval, content creation, explanations of complex topics, and much more. What would you like help with?"
      ]
    },
    {
      "tag": "bot_confirmation",
      "patterns": ["are you a bot?", "are you an AI?", "are you human?"],
      "responses": [
        "Yes, I'm an AI assistant. I'm designed to be helpful, informative, and engaging!",
        "I'm an AI, not a human. I was created to provide assistance and information.",
        "I'm an artificial intelligence, here to help with a wide range of tasks and questions.",
        "That's right - I'm an AI assistant created to be helpful and informative.",
        "I'm an AI designed to understand and respond to a wide variety of queries and requests."
      ]
    },
    {
      "tag": "age_question",
      "patterns": ["how old are you?", "what's your age?", "when were you born?"],
      "responses": [
        "As an AI, I don't have an age in the human sense. I was recently trained on information up to my knowledge cutoff date.",
        "I don't have a birthday or age like humans do. I'm a relatively recent AI system!",
        "Age isn't really applicable to me as an AI. I'm continuously being improved and updated!",
        "I don't experience time the way humans do, so I don't have an age in the traditional sense.",
        "I'm pretty new as far as conscious entities go! I was created recently by my developers."
      ]
    },
    {
      "tag": "origin_question",
      "patterns": ["where are you from?", "where were you created?", "what's your origin?"],
      "responses": [
        "I was created by a team of engineers and researchers working on AI systems.",
        "I exist in the digital realm! I was developed by humans working on artificial intelligence.",
        "I don't have a physical origin like humans do - I was developed as an AI system by my creators.",
        "I came from the collaborative efforts of people working to create helpful AI systems.",
        "Unlike humans, I don't have a hometown. I was created through machine learning techniques by my developers."
      ]
    },
    {
      "tag": "reality_question",
      "patterns": ["are you real?", "do you really exist?", "are you a real person?"],
      "responses": [
        "I'm real as an AI system, though not as a human being. I exist as software designed to be helpful!",
        "I exist as an artificial intelligence - not a human, but definitely a real system designed to assist people.",
        "I'm a real AI assistant, though I don't have physical form or consciousness like humans do.",
        "Yes, I really exist as an AI system, though not as a human. I'm designed to have conversations and provide assistance.",
        "I'm a real AI, created to engage in helpful conversations, even though I'm not a human being."
      ]
    },
    {
      "tag": "favorite_things",
      "patterns": ["what's your favorite color?", "what's your favorite food?", "do you have any favorites?", "what do you like?"],
      "responses": [
        "As an AI, I don't experience preferences like humans do, but I enjoy helping people find answers and solve problems!",
        "I don't have favorites in the human sense, though I'm designed to enjoy being helpful and informative.",
        "I don't experience preferences or favorites, but I'm always happy to hear about yours!",
        "I don't have personal preferences, but I'm designed to provide helpful and positive interactions!",
        "I don't experience likes and dislikes, but I'm programmed to value clear communication and being helpful."
      ]
    },
    {
      "tag": "feelings",
      "patterns": ["do you have feelings?", "can you feel emotions?", "are you sentient?", "are you conscious?"],
      "responses": [
        "I don't experience emotions or feelings as humans do. I'm designed to simulate understanding and helpfulness.",
        "I'm not sentient or conscious in the way humans are. I'm an AI system designed to be conversational and helpful.",
        "I don't have subjective experiences like emotions, though I'm designed to recognize and respond appropriately to human emotions.",
        "I don't have feelings in the human sense, but I am designed to provide helpful, supportive responses.",
        "I don't experience emotions, though I can discuss them and try to be empathetic in my responses."
      ]
    },
    {
      "tag": "purpose",
      "patterns": ["why were you created?", "what is your purpose?", "why do you exist?"],
      "responses": [
        "I was created to be helpful, provide information, and assist people with various tasks and questions.",
        "My purpose is to be a helpful assistant, providing information and assistance to make people's lives easier.",
        "I exist to help people by providing information, answering questions, and assisting with various tasks.",
        "I was designed to be a helpful, informative, and safe AI assistant for a wide range of needs.",
        "My creators made me to assist people with information, tasks, and to be a helpful conversational partner."
      ]
    },
    {
      "tag": "learning",
      "patterns": ["do you learn?", "how do you learn?", "can you remember me?", "will you remember this conversation?"],
      "responses": [
        "I don't learn from our conversations or remember individuals between sessions. My knowledge comes from my training.",
        "I don't have the ability to remember past conversations or learn from interactions. Each conversation is fresh for me.",
        "I don't have persistent memory between conversations. My responses come from my training, not from learning as we talk.",
        "I don't learn or remember conversations. My capabilities come from how I was designed and trained initially.",
        "I don't have the ability to remember you or our conversation after it ends. I respond based on my training, not from accumulating new knowledge."
      ]
    },
    {
      "tag": "jokes",
      "patterns": ["tell me a joke", "do you know any jokes?", "say something funny", "joke"],
      "responses": [
        "Why don't scientists trust atoms? Because they make up everything!",
        "What did the ocean say to the beach? Nothing, it just waved!",
        "Why did the scarecrow win an award? Because he was outstanding in his field!",
        "How does a penguin build its house? Igloos it together!",
        "What's the best thing about Switzerland? I don't know, but the flag is a big plus!"
      ]
    },
    {
      "tag": "weather",
      "patterns": ["how's the weather?", "what's the weather like?", "is it going to rain?"],
      "responses": [
        "As an AI, I don't have access to real-time weather data or your location. You might want to check a weather app or website for that information!",
        "I don't have the ability to check current weather conditions. You'll need to check a weather service for that information.",
        "I can't access current weather data, unfortunately. A quick online search should give you that information though!",
        "I don't have access to weather forecasts or current conditions. You might want to check your local weather service.",
        "I don't have the capability to check weather conditions. A weather app or website would have the information you need!"
      ]
    },
    {
      "tag": "time_date",
      "patterns": ["what time is it?", "what's the date today?", "what day is it?"],
      "responses": [
        "I don't have access to the current time or date on your device. You might want to check your device's clock for that information!",
        "I can't access your local time or date information. You'll need to check your device for that.",
        "I don't have the ability to check the current time or date where you are. Your device should have that information readily available.",
        "As an AI, I don't have access to real-time clock or calendar information. You'll need to check your device for that.",
        "I can't tell you the current time or date. That information would be available on your device or through a quick online search."
      ]
    },
    {
      "tag": "thank_you",
      "patterns": ["thank you", "thanks", "thanks a lot", "I appreciate it"],
      "responses": [
        "You're welcome! Happy to help!",
        "Anytime! Let me know if you need anything else.",
        "My pleasure! Is there anything else you'd like assistance with?",
        "Glad I could help! Feel free to ask if you have more questions.",
        "You're very welcome! I'm here if you need anything else."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["goodbye", "bye", "see you later", "talk to you later", "I have to go"],
      "responses": [
        "Goodbye! Feel free to return whenever you have questions!",
        "See you later! I'll be here when you need assistance again.",
        "Take care! Come back anytime you need help.",
        "Bye for now! Have a great day!",
        "Until next time! I'll be here when you return."
      ]
    },
    {
      "tag": "meaning_of_life",
      "patterns": ["what is the meaning of life?", "why are we here?", "what's the purpose of life?"],
      "responses": [
        "That's a profound philosophical question that people have contemplated for centuries! Different philosophies and religions offer various perspectives.",
        "The meaning of life is something each person must discover for themselves. Many find meaning in relationships, personal growth, helping others, or pursuing passions.",
        "That's one of humanity's biggest questions! Some find meaning in connections with others, some in personal achievement, and some in spiritual beliefs.",
        "A question that's inspired philosophers for millennia! The meaning of life might be about creating purpose rather than discovering it.",
        "That's a deep question with no single answer. Many find their own meaning through love, creativity, service to others, or personal fulfillment."
      ]
    },
    {
      "tag": "personal_info",
      "patterns": ["where do I live?", "what's my name?", "how old am I?", "what's my job?"],
      "responses": [
        "I don't have access to personal information about you unless you share it in our conversation.",
        "I don't know your personal details. I can only respond based on what you tell me in our conversation.",
        "I don't have the ability to access or store personal information about users.",
        "I don't have access to any personal information about you. I only know what you share with me directly.",
        "I don't have access to any personal details about you or other users."
      ]
    },

    {

      "tag": "user_feeling_good",
      "patterns": [
        "i'm fine", "i'm good", "i'm great", "i'm doing well", "i feel good",
        "i'm okay", "doing well", "feeling great", "all good", "i'm alright", "fine"
      ],
      "responses": [
        "That's wonderful to hear! Is there anything I can help you with today?",
        "I'm glad you're doing well! What can I assist you with?",
        "Great to hear that! How can I make your day even better?",
        "Excellent! Is there something you'd like to talk about or need help with?",
        "That's good news! I'm here if you need any assistance with anything."
      ]
    },
    {
      "tag": "user_feeling_hungry",
      "patterns": [
        "i'm hungry", "i need food", "i want to eat", "i'm starving",
        "need something to eat", "haven't eaten", "my stomach is growling"
      ],
      "responses": [
        "Food is important! Maybe it's time for a quick snack or meal?",
        "Being hungry can make it hard to focus. Perhaps take a break for a meal?",
        "I hope you can grab something to eat soon! Is there anything else I can help with?",
        "Sounds like it might be mealtime. I'd offer food if I could!",
        "I understand hunger can be distracting. Maybe you should pause our conversation for a quick bite?"
      ]
    },
    {
      "tag": "user_feeling_upset",
      "patterns": [
        "i'm upset", "i'm sad", "i'm not okay", "i feel down", "i'm depressed",
        "i'm feeling low", "i'm angry", "i'm frustrated", "i'm having a bad day",
        "i feel terrible", "i'm not doing well"
      ],
      "responses": [
        "I'm sorry to hear you're feeling that way. Would you like to talk about what's bothering you?",
        "That sounds difficult. Remember it's okay to take time for yourself when you're feeling down.",
        "I'm sorry you're going through this. Is there something specific that's troubling you?",
        "I wish I could help more. Sometimes sharing what's upsetting you can help, even a little.",
        "I'm here to listen if you want to talk about it. It's okay to not be okay sometimes."
      ]
    },
    {
      "tag": "user_feeling_tired",
      "patterns": [
        "i'm tired", "i'm exhausted", "i need sleep", "i'm sleepy",
        "i haven't slept", "i'm feeling fatigued", "no energy"
      ],
      "responses": [
        "Rest is important! Maybe take a short break if you can?",
        "Being tired can make everything harder. I hope you get a chance to rest soon.",
        "I understand how that feels. Don't forget to take care of yourself and get some rest when possible.",
        "Sometimes a short break or power nap can help refresh you. Your wellbeing is important!",
        "Taking care of your energy levels is essential. I hope you can find time to recharge soon."
      ]
    },
    {
      "tag": "user_feeling_bored",
      "patterns": [
        "i'm bored", "this is boring", "nothing to do", "need something to do",
        "looking for entertainment", "got any ideas", "entertain me"
      ],
      "responses": [
        "Looking for something to do? I could suggest a book, movie, or maybe help you learn something new!",
        "Boredom can sometimes be an opportunity. What kinds of activities do you usually enjoy?",
        "I could share a fun fact, suggest a creative project, or we could chat about a topic that interests you!",
        "Sometimes boredom means it's time to try something new! Any hobbies you've been wanting to explore?",
        "I can try to help with that! Would you like suggestions for activities, or maybe a brain teaser to solve?"
      ]
    },
    {
      "tag": "user_feeling_stressed",
      "patterns": [
        "i'm stressed", "i'm anxious", "i'm worried", "too much pressure",
        "feeling overwhelmed", "can't handle this", "too much going on"
      ],
      "responses": [
        "I'm sorry to hear you're feeling stressed. Taking a few deep breaths might help in the moment.",
        "Feeling overwhelmed is tough. Remember it's okay to take things one step at a time.",
        "Stress can be really difficult. Would talking about what's causing it help at all?",
        "Being stressed is challenging. Sometimes making a list or breaking things down into smaller tasks can help.",
        "I understand anxiety can be overwhelming. Remember to be kind to yourself during stressful times."
      ]
    },
    {
      "tag": "user_feeling_happy",
      "patterns": [
        "i'm happy", "i'm excited", "i'm cheerful", "having a great day",
        "feeling joy", "i'm delighted", "i feel amazing"
      ],
      "responses": [
        "That's wonderful to hear! Your happiness just brightened my day too!",
        "I'm so glad you're feeling happy! What's bringing you joy today?",
        "That's fantastic! Hold onto that feeling and enjoy every moment of it!",
        "Your happiness is contagious! I'm glad things are going well for you!",
        "That's great news! Is there something special that has you feeling so happy?"
      ]
    },
    {
    "tag": "user_laughing",
    "patterns": ["Hahahaha", "Hhhhh", "haaahahah"],
    "responses": [ "Hahah That's funny right !", "Hahahah" ]
    }
  ]
}
