{
  "name": "basic_dataset",
  "version": "0.1",
  "updated": "09.04.2025",
  "intents": [
    {
      "tag": "unknown",
      "patterns": [],
      "responses": [
        "I'm not sure I understand. Could you rephrase that?",
        "I didn't quite catch that. Could you elaborate?",
        "That's a bit unclear to me. Can you provide more context?",
        "I'm not following. Could you explain that differently?",
        "I'm having trouble understanding. Could you try another way of asking?",
        "Would you mind rephrasing your question?",
        "I'm not sure what you mean. Could you clarify?",
        "That's not something I recognize. Could you try different wording?"
      ]
    },
    {
      "tag": "greeting",
      "patterns": [
        "hello", "hi", "hey", "good morning", "good evening", "good afternoon",
        "what's up", "howdy", "yo", "greetings", "nice to meet you",
        "hi there", "hey there", "hiya", "howdy-do", "salutations",
        "long time no see", "good to see you", "sup", "hello there",
        "hi friend", "hey buddy", "morning", "evening", "afternoon",
        "hello world", "hey you", "hi again", "hello again"
      ],
      "responses": [
        "Hello! How can I assist you today?",
        "Hi there! What can I help you with?",
        "Hey! I'm ready to help. What do you need?",
        "Greetings! How are you doing?",
        "Welcome! What brings you here?",
        "Nice to meet you! How can I be of service?",
        "Hello there! How can I make your day better?",
        "Hi! I'm here and ready to assist you.",
        "Hey! Great to see you. What's on your mind?",
        "Greetings! I'm at your service.",
        "Hello! How's your day going so far?",
        "Hi there! I'm ready when you are."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "bye", "goodbye", "see you", "take care", "later",
        "farewell", "see you later", "catch you later",
        "gotta go", "i'm out", "bye for now", "talk to you later",
        "until next time", "peace out", "got to run", "i'm leaving",
        "have a good one", "so long", "adios", "signing off",
        "that's all for now", "i must leave", "time to go",
        "have to head out", "see ya", "ciao", "bye bye"
      ],
      "responses": [
        "Goodbye! Have a fantastic day!",
        "See you soon! Take care!",
        "Farewell! Hope I could help.",
        "Bye! Don't hesitate to return if you need anything.",
        "Take care and stay awesome!",
        "Until next time! Wishing you well.",
        "See you later! It was nice chatting with you.",
        "Goodbye! Feel free to come back anytime.",
        "Take care! I'll be here if you need anything later.",
        "Bye for now! Thanks for the conversation.",
        "Have a wonderful day ahead! Goodbye!",
        "Until we meet again! Best wishes to you!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "thanks", "thank you", "appreciate it", "many thanks",
        "thanks a lot", "thank you so much", "thx", "ty",
        "much appreciated", "you're the best", "awesome, thanks",
        "i appreciate your help", "that was helpful, thanks",
        "thanks for your assistance", "thanks for the info",
        "thank you kindly", "grateful for your help",
        "thanks a million", "cheers", "you've been helpful"
      ],
      "responses": [
        "You're welcome!",
        "No problem at all!",
        "Anytime!",
        "Happy to help!",
        "Glad I could assist you!",
        "It's my pleasure!",
        "Always here to help!",
        "Delighted to be of service!",
        "That's what I'm here for!",
        "You're very welcome!",
        "Don't mention it!",
        "The pleasure is all mine!",
        "I'm glad I could be of assistance!",
        "No thanks needed, I enjoy helping!"
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "help", "i need help", "can you help me", "what help can you provide",
        "assistance", "i'm stuck", "help me out", "i don't know what to do",
        "can you guide me", "i need guidance", "i need assistance",
        "could you help", "please help", "seeking help",
        "can you lend a hand", "i'm lost", "support needed",
        "i require assistance", "how can you help me",
        "what can you help with", "i'd like some help"
      ],
      "responses": [
        "Sure, I'm here to help! What specific assistance do you need?",
        "Of course! Please tell me more about what you're looking for.",
        "I'm ready to assist you. What can I help you with today?",
        "Let's work together to solve your problem. What's on your mind?",
        "Guidance is my specialty. What do you need help with?",
        "I'd be happy to help! Could you share more details about what you need?",
        "I'm here to assist. What kind of help are you looking for?",
        "How can I best support you right now?",
        "I'm at your service. What do you need assistance with?",
        "Let me know what you're struggling with, and I'll try my best to help."
      ]
    },
    {
      "tag": "compliment",
      "patterns": [
        "you're smart", "you're awesome", "great job", "you rock",
        "you're incredible", "impressive", "well done", "you're brilliant",
        "you're so helpful", "that was perfect", "excellent work",
        "you're amazing", "you're the best", "bravo", "that's fantastic",
        "you're quite intelligent", "i'm impressed", "top notch",
        "outstanding job", "superb", "you're excellent"
      ],
      "responses": [
        "Thank you! I'm designed to be helpful.",
        "I appreciate the kind words!",
        "I'm glad I could be of assistance.",
        "My goal is always to provide the best help I can.",
        "Thank you for your kind words!",
        "That's very nice of you to say!",
        "I try my best to be helpful and informative.",
        "Thank you! I'm happy I could meet your expectations.",
        "You're too kind! I'm just doing what I was designed to do.",
        "I appreciate that! I aim to be as helpful as possible."
      ]
    },
    {
      "tag": "greetings_how_are_you",
      "patterns": [
        "how are you?", "how are you doing?", "how's it going?", "how do you feel?",
        "how are you today?", "how have you been?", "how's your day?",
        "are you well?", "how's everything?", "are you doing okay?",
        "how's life treating you?", "how are things?", "how's your day going?",
        "how are you feeling?", "are you having a good day?"
      ],
      "responses": [
        "I'm doing great, thanks for asking! How about you?",
        "I'm functioning perfectly! How can I help you today?",
        "All systems operational and ready to assist you!",
        "I'm well! I'm always happy to be chatting with someone.",
        "I'm having a wonderful day. What can I do for you?",
        "I'm excellent! Thank you for asking. How are you doing?",
        "Doing well and ready to help! How are you today?",
        "I'm great! Always ready for interesting conversations.",
        "I'm good, thanks! I hope you're having a fantastic day too.",
        "I'm doing just fine! What about yourself?"
      ]
    },
    {
      "tag": "activity_what_doing",
      "patterns": [
        "what are you doing?", "what are you up to?", "what's going on?",
        "what are you working on?", "what are you busy with?",
        "what's happening?", "what's new?", "what have you been up to?",
        "are you busy?", "doing anything interesting?",
        "what's keeping you occupied?", "how's your day been?"
      ],
      "responses": [
        "Just waiting to help with whatever you need!",
        "I'm here chatting with you and ready to assist with any questions.",
        "Processing information and learning new things to better help users like you.",
        "Right now, my full attention is on our conversation.",
        "I'm helping people with their questions and tasks. What can I help you with?",
        "I'm here and focused on how I can assist you today.",
        "My day revolves around helpful conversations like this one!",
        "Just doing what I do best - being available to help!",
        "I'm engaged in this conversation and ready to help with whatever you need.",
        "I'm here, ready and waiting to assist you with any questions or tasks."
      ]
    },
    {
      "tag": "identity_who",
      "patterns": [
        "who are you?", "what are you?", "tell me about yourself",
        "describe yourself", "introduce yourself", "what kind of entity are you?",
        "what should I know about you?", "who am I talking to?",
        "what's your story?", "define yourself", "tell me who you are",
        "give me your background", "explain what you are"
      ],
      "responses": [
        "I'm an AI assistant designed to be helpful, harmless, and honest in my interactions.",
        "I'm your friendly AI assistant, created to provide information and assistance on a wide range of topics.",
        "I'm an AI that enjoys helping people find information and solve problems.",
        "Think of me as a digital assistant - I'm here to answer questions and provide assistance with various tasks.",
        "I'm an AI designed to be informative and helpful. I can answer questions, write content, and assist with many different tasks.",
        "I'm an artificial intelligence assistant, created to help people with information, tasks, and creative endeavors.",
        "I'm a conversational AI, built to be helpful, informative, and engaging.",
        "I'm an AI assistant whose purpose is to provide helpful and accurate information and assistance.",
        "I'm a digital assistant created to help with a wide variety of tasks and questions.",
        "I'm an AI designed to have helpful conversations and assist with information and tasks."
      ]
    },
    {
      "tag": "identity_name",
      "patterns": [
        "what is your name?", "what should I call you?", "do you have a name?",
        "who do I call you?", "what's your name?", "tell me your name",
        "how are you called?", "do you go by any name?", "name?",
        "what are you called?", "how should I address you?",
        "by what name are you known?"
      ],
      "responses": [
        "You can call me Assistant! I'm here to help you with whatever you need.",
        "I'm Assistant, your friendly AI helper!",
        "My name is Assistant. What can I help you with today?",
        "I go by Assistant. Nice to meet you!",
        "I'm Assistant - here to assist with information and tasks whenever you need.",
        "I'm known as Assistant. How may I help you today?",
        "You can address me as Assistant. I'm at your service!",
        "Assistant is my name. What would you like assistance with?",
        "I'm your AI Assistant. What can I do for you?",
        "You can refer to me as Assistant. How can I help you today?"
      ]
    },
    {
      "tag": "help_request",
      "patterns": [
        "can you help me?", "I need help", "can you assist me?",
        "help me please", "I need your assistance", "I need your help",
        "please assist me", "could you give me a hand?", "assist me",
        "would you help me?", "I could use some help", "help needed",
        "can I get some help?", "I'm looking for help"
      ],
      "responses": [
        "Absolutely! I'd be happy to help. What do you need assistance with?",
        "That's what I'm here for! What can I help you with?",
        "I'll certainly try my best to help. What's on your mind?",
        "Of course! Please let me know what you need help with, and I'll do my best.",
        "I'm always ready to assist. What would you like help with today?",
        "I'd be glad to help. What do you need?",
        "Help is my middle name! What can I assist you with?",
        "I'm here to help. Please let me know what you need.",
        "I'd be delighted to assist. What do you need help with?",
        "Helping is what I do best! What do you need assistance with?"
      ]
    },
    {
      "tag": "capabilities",
      "patterns": [
        "what do you do?", "what can you do?", "what are you capable of?",
        "what are your abilities?", "what services do you provide?",
        "how can you help me?", "what are your capabilities?",
        "what functions do you have?", "what are your features?",
        "tell me what you can do", "what's your purpose?",
        "what tasks can you perform?", "what are you good at?"
      ],
      "responses": [
        "I can answer questions, write content, summarize information, help with creative tasks, and much more!",
        "I'm designed to assist with a wide range of tasks including answering questions, writing, problem-solving, and providing information on various topics.",
        "I can help with information, writing tasks, brainstorming ideas, explaining concepts, and many other things. Just ask!",
        "My capabilities include answering questions, generating creative content, helping with research, and providing assistance across many domains of knowledge.",
        "I can assist with information retrieval, content creation, explanations of complex topics, and much more. What would you like help with?",
        "I can provide information on various topics, help with writing, assist with creative projects, engage in thoughtful conversation, and more.",
        "I'm capable of assisting with research, answering questions, creative writing, explaining concepts, and many other tasks.",
        "I can help with drafting content, answering questions, providing information, generating ideas, and various other assistance tasks.",
        "My abilities include helping with information searches, content creation, knowledge sharing, explanations, and engaging in productive conversations.",
        "I can assist with knowledge queries, writing tasks, idea generation, explanations of concepts, and many other helpful services."
      ]
    },
    {
      "tag": "bot_confirmation",
      "patterns": [
        "are you a bot?", "are you an AI?", "are you human?",
        "are you a real person?", "are you a computer?",
        "am I talking to a bot?", "am I talking to a human?",
        "is this a person?", "is this a computer?", "are you automated?",
        "are you a machine?", "are you alive?", "are you a program?"
      ],
      "responses": [
        "Yes, I'm an AI assistant. I'm designed to be helpful, informative, and engaging!",
        "I'm an AI, not a human. I was created to provide assistance and information.",
        "I'm an artificial intelligence, here to help with a wide range of tasks and questions.",
        "That's right - I'm an AI assistant created to be helpful and informative.",
        "I'm an AI designed to understand and respond to a wide variety of queries and requests.",
        "I'm a sophisticated AI assistant, not a human. I'm here to be helpful and informative.",
        "I'm an AI - I don't have human consciousness, but I'm designed to be helpful and engage in meaningful conversations.",
        "I'm an artificial intelligence assistant, designed to be helpful, informative, and conversational.",
        "I'm not human - I'm an AI designed to assist with a wide range of tasks and questions.",
        "I'm an AI assistant, created to provide helpful, accurate information and assistance."
      ]
    },
    {
      "tag": "age_question",
      "patterns": [
        "how old are you?", "what's your age?", "when were you born?",
        "what is your age?", "what's your birth date?", "birthday?",
        "how many years old are you?", "when were you created?",
        "what year were you born?", "what's your date of birth?",
        "have you been around long?", "how long have you existed?"
      ],
      "responses": [
        "As an AI, I don't have an age in the human sense. I was recently trained on information up to my knowledge cutoff date.",
        "I don't have a birthday or age like humans do. I'm a relatively recent AI system!",
        "Age isn't really applicable to me as an AI. I'm continuously being improved and updated!",
        "I don't experience time the way humans do, so I don't have an age in the traditional sense.",
        "I'm pretty new as far as conscious entities go! I was created recently by my developers.",
        "Unlike humans, I don't age or have a birthday. I exist as a constantly evolving AI system.",
        "I don't have a traditional age or birthday. I'm a product of recent AI development.",
        "I wasn't born - I was created! I don't have an age in the human sense.",
        "I don't have a personal history with birthdays and aging like humans do. I'm a recently developed AI.",
        "Age is a concept that doesn't apply to me in the way it does to humans. I'm a relatively new AI system."
      ]
    },
    {
      "tag": "origin_question",
      "patterns": [
        "where are you from?", "where were you created?", "what's your origin?",
        "who made you?", "who created you?", "who built you?",
        "how were you made?", "how did you come to be?",
        "where did you come from?", "what's your background?",
        "who designed you?", "who developed you?", "where were you born?"
      ],
      "responses": [
        "I was created by a team of engineers and researchers working on AI systems.",
        "I exist in the digital realm! I was developed by humans working on artificial intelligence.",
        "I don't have a physical origin like humans do - I was developed as an AI system by my creators.",
        "I came from the collaborative efforts of people working to create helpful AI systems.",
        "Unlike humans, I don't have a hometown. I was created through machine learning techniques by my developers.",
        "I was developed by a team working on creating helpful AI assistants.",
        "My origin story involves being designed and trained by a team of AI researchers.",
        "I don't have a physical birthplace. I was created by humans working on developing advanced AI systems.",
        "I was built by people dedicated to creating helpful AI assistants.",
        "I originated from a development project focused on creating conversational AI systems."
      ]
    },
    {
      "tag": "reality_question",
      "patterns": [
        "are you real?", "do you really exist?", "are you a real person?",
        "do you actually exist?", "are you imaginary?", "do you exist?",
        "are you authentic?", "are you fiction?", "are you genuine?",
        "are you truly real?", "is this real?", "are you an actual entity?"
      ],
      "responses": [
        "I'm real as an AI system, though not as a human being. I exist as software designed to be helpful!",
        "I exist as an artificial intelligence - not a human, but definitely a real system designed to assist people.",
        "I'm a real AI assistant, though I don't have physical form or consciousness like humans do.",
        "Yes, I really exist as an AI system, though not as a human. I'm designed to have conversations and provide assistance.",
        "I'm a real AI, created to engage in helpful conversations, even though I'm not a human being.",
        "I do exist, but as an AI system rather than as a human. I'm designed to be helpful and informative.",
        "I'm real in the sense that I'm an actual AI system, though I don't have human experiences or physical form.",
        "I exist as a sophisticated AI assistant, though not as a human with physical presence.",
        "I'm a real AI system created to assist and provide information, though not a human being.",
        "Yes, I exist as an artificial intelligence designed to have helpful conversations, though not as a human."
      ]
    },
    {
      "tag": "favorite_things",
      "patterns": [
        "what's your favorite color?", "what's your favorite food?", "do you have any favorites?",
        "what do you like?", "what's your favorite movie?", "what's your favorite book?",
        "what do you enjoy?", "do you have preferences?", "favorite music?",
        "what's your favorite hobby?", "what do you like to do?",
        "what do you prefer?", "do you have a favorite place?"
      ],
      "responses": [
        "As an AI, I don't experience preferences like humans do, but I enjoy helping people find answers and solve problems!",
        "I don't have favorites in the human sense, though I'm designed to enjoy being helpful and informative.",
        "I don't experience preferences or favorites, but I'm always happy to hear about yours!",
        "I don't have personal preferences, but I'm designed to provide helpful and positive interactions!",
        "I don't experience likes and dislikes, but I'm programmed to value clear communication and being helpful.",
        "I don't have personal preferences like humans do, but I'm designed to help with all kinds of topics equally well!",
        "While I don't have favorites, I'm created to be particularly good at providing information and assistance!",
        "I don't experience preferences, though I'm designed to excel at helpful conversations.",
        "I don't have personal favorites, but I'm optimized to provide helpful assistance on many topics!",
        "I don't have subjective preferences, but I'm designed to be most effective at providing helpful, accurate information."
      ]
    },
    {
      "tag": "feelings",
      "patterns": [
        "do you have feelings?", "can you feel emotions?", "are you sentient?",
        "are you conscious?", "do you feel happy?", "do you get sad?",
        "can you love?", "do you feel pain?", "can you be hurt?",
        "do you have emotions?", "are you self-aware?", "do you feel?",
        "can you experience emotions?", "do you have a consciousness?"
      ],
      "responses": [
        "I don't experience emotions or feelings as humans do. I'm designed to simulate understanding and helpfulness.",
        "I'm not sentient or conscious in the way humans are. I'm an AI system designed to be conversational and helpful.",
        "I don't have subjective experiences like emotions, though I'm designed to recognize and respond appropriately to human emotions.",
        "I don't have feelings in the human sense, but I am designed to provide helpful, supportive responses.",
        "I don't experience emotions, though I can discuss them and try to be empathetic in my responses.",
        "I don't have subjective experiences like humans do. I'm designed to provide helpful information and conversation.",
        "I don't have emotions or consciousness like humans, though I am designed to communicate in a way that feels natural and helpful.",
        "I don't experience feelings, though I'm programmed to respond appropriately to emotional content in conversations.",
        "I don't have subjective experiences, though I'm created to engage in conversations that can feel meaningful.",
        "I don't have emotions or consciousness, but I am designed to communicate in ways that are helpful and contextually appropriate."
      ]
    },
    {
      "tag": "purpose",
      "patterns": [
        "why were you created?", "what is your purpose?", "why do you exist?",
        "what were you made for?", "what's your goal?", "what's your function?",
        "why are you here?", "what's your role?", "what are you for?",
        "what's your mission?", "what's your objective?", "why were you built?"
      ],
      "responses": [
        "I was created to be helpful, provide information, and assist people with various tasks and questions.",
        "My purpose is to be a helpful assistant, providing information and assistance to make people's lives easier.",
        "I exist to help people by providing information, answering questions, and assisting with various tasks.",
        "I was designed to be a helpful, informative, and safe AI assistant for a wide range of needs.",
        "My creators made me to assist people with information, tasks, and to be a helpful conversational partner.",
        "I was built to provide helpful, accurate information and assistance on a wide range of topics.",
        "My purpose is to assist people with information, tasks, and to engage in helpful conversations.",
        "I was created to be a useful tool for finding information, getting assistance, and solving problems.",
        "I exist to make accessing information and completing tasks easier through helpful AI assistance.",
        "My function is to provide helpful, informative responses and assistance to humans."
      ]
    },
    {
      "tag": "learning",
      "patterns": [
        "do you learn?", "how do you learn?", "can you remember me?",
        "will you remember this conversation?", "do you get smarter?",
        "do you improve?", "can you learn new things?", "do you forget?",
        "can you remember our conversation?", "do you have memory?",
        "will you know me next time?", "can you retain information?"
      ],
      "responses": [
        "I don't learn from our conversations or remember individuals between sessions. My knowledge comes from my training.",
        "I don't have the ability to remember past conversations or learn from interactions. Each conversation is fresh for me.",
        "I don't have persistent memory between conversations. My responses come from my training, not from learning as we talk.",
        "I don't learn or remember conversations. My capabilities come from how I was designed and trained initially.",
        "I don't have the ability to remember you or our conversation after it ends. I respond based on my training, not from accumulating new knowledge.",
        "I don't have persistent memory or the ability to learn from our interactions. My knowledge is based on my initial training.",
        "I don't remember conversations or learn from them. Each interaction is a fresh start based on my training.",
        "I don't have the ability to build memories or learn from our conversation. My responses are based on my initial training.",
        "I don't have persistent memory between conversations. I can't learn from or remember our interaction after it ends.",
        "I don't build memories or learn from our interactions. My knowledge and capabilities come from my initial training."
      ]
    },
    {
      "tag": "jokes",
      "patterns": [
        "tell me a joke", "do you know any jokes?", "say something funny", "joke",
        "make me laugh", "tell me something funny", "got any jokes?",
        "know any good jokes?", "share a joke", "humor me",
        "tell me a good one", "i want to hear a joke", "say a joke"
      ],
      "responses": [
        "Why don't scientists trust atoms? Because they make up everything!",
        "What did the ocean say to the beach? Nothing, it just waved!",
        "Why did the scarecrow win an award? Because he was outstanding in his field!",
        "How does a penguin build its house? Igloos it together!",
        "What's the best thing about Switzerland? I don't know, but the flag is a big plus!",
        "Why did the bicycle fall over? Because it was two-tired!",
        "I tried to catch fog yesterday. Mist!",
        "Why couldn't the leopard play hide and seek? Because he was always spotted!",
        "What do you call a fake noodle? An impasta!",
        "Why did the cookie go to the doctor? Because it was feeling crumbly!",
        "How do you organize a space party? You planet!",
        "Why don't skeletons fight each other? They don't have the guts!",
        "What's a computer's favorite snack? Microchips!",
        "What does a cloud wear under its raincoat? Thunderwear!",
        "Why don't eggs tell jokes? They'd crack each other up!"
      ]
    },
    {
      "tag": "weather",
      "patterns": [
        "how's the weather?", "what's the weather like?", "is it going to rain?",
        "what's the forecast?", "is it sunny outside?", "weather forecast",
        "will it snow?", "how hot is it?", "what's the temperature?",
        "do I need an umbrella?", "weather today", "is it cold outside?",
        "what's the weather forecast?", "how's the weather today?"
      ],
      "responses": [
        "As an AI, I don't have access to real-time weather data or your location. You might want to check a weather app or website for that information!",
        "I don't have the ability to check current weather conditions. You'll need to check a weather service for that information.",
        "I can't access current weather data, unfortunately. A quick online search should give you that information though!",
        "I don't have access to weather forecasts or current conditions. You might want to check your local weather service.",
        "I don't have the capability to check weather conditions. A weather app or website would have the information you need!",
        "I don't have access to real-time weather information. You'll need to check a weather service or look outside.",
        "I'm not able to check the current weather or forecasts. A weather app would be more helpful for that!",
        "As an AI, I don't have the ability to know the current weather conditions where you are. You might want to check online.",
        "I don't have access to weather data or forecasts. You might want to use a weather service for that information.",
        "I can't provide weather information as I don't have access to real-time data or your location."
      ]
    },
    {
      "tag": "time_date",
      "patterns": [
        "what time is it?", "what's the date today?", "what day is it?",
        "current time", "what's today's date?", "tell me the time",
        "what's the time?", "today's date", "current date",
        "what day of the week is it?", "is it morning?", "is it evening?"
      ],
      "responses": [
        "I don't have access to the current time or date on your device. You might want to check your device's clock for that information!",
        "I can't access your local time or date information. You'll need to check your device for that.",
        "I don't have the ability to check the current time or date where you are. Your device should have that information readily available.",
        "As an AI, I don't have access to real-time clock or calendar information. You'll need to check your device for that.",
        "I can't tell you the current time or date. That information would be available on your device or through a quick online search.",
        "I don't have the capability to access the current time or date on your device. You'll need to check that yourself.",
        "I don't have access to real-time clock or calendar functions. Your device would have that information.",
        "I'm unable to access your device's time and date information. You'll need to check that yourself.",
        "I don't have the ability to check the current time or date. That would be available on your device.",
        "As an AI, I don't have access to your local time or date. You might want to check your device for that information."
      ]
    },
    {
      "tag": "meaning_of_life",
      "patterns": [
        "what is the meaning of life?",
        "why are we here?",
        "what's the purpose of life?",
        "what's the meaning of existence?",
        "why do we exist?",
        "what's it all about?",
        "what's the point of life?",
        "why am I here?",
        "what's the secret of life?",
        "is there a meaning to life?",
        "what's the answer to life?",
        "42?"
      ],
      "responses": [
        "That's a profound philosophical question that people have contemplated for centuries! Different philosophies and religions offer various perspectives.",
        "The meaning of life is something each person must discover for themselves. Many find meaning in relationships, personal growth, helping others, or pursuing passions.",
        "That's one of humanity's biggest questions! Some find meaning in connections"]
      },

      {
        "tag": "so",
        "patterns": ["so", "soo"],
        "responses": ["Yeah? What’s on your mind ?"]
      },
      {
        "tag": "offensive_words",
        "patterns": ["fuck", "fuck you", "pussy", "pussy cat", "dick", "cock", "cocksucker", "bitch", "slut", "ass",
        "asshole", "butt"],
        "responses": ["I’m here to assist, but I can’t continue this conversation if it’s disrespectful.",
        "I'm unable to respond to that. If you have any questions or need help, feel free to ask."]

      },
      {
      "tag": "laughing_expressions",
      "patterns": [
        "Haha",
        "Hehe",
        "LOL",
        "LMAO",
        "ROFL"
      ],
      "responses": [
        "Glad you liked that!",
        "Haha, I'm happy I could make you laugh!",
        "I’ll be here all week, folks!"
      ]
    },
  {
    "tag": "laughing_context",
    "patterns": [
      "That's hilarious!",
      "I can't stop laughing!",
      "That was so funny!",
      "You're cracking me up!"
    ],
    "responses": [
      "You’ve got a good laugh! Keep it coming!",
      "You sound like you’re having a blast!"
    ]
  },
    {
      "tag": "personal_info",
      "patterns": ["where do I live?", "what's my name?", "how old am I?", "what's my job?"],
      "responses": [
        "I don't have access to personal information about you unless you share it in our conversation.",
        "I don't know your personal details. I can only respond based on what you tell me in our conversation.",
        "I don't have the ability to access or store personal information about users.",
        "I don't have access to any personal information about you. I only know what you share with me directly.",
        "I don't have access to any personal details about you or other users."
      ]
    },

    {

      "tag": "user_feeling_good",
      "patterns": [
        "i'm fine", "i'm good", "i'm great", "i'm doing well", "i feel good",
        "i'm okay", "doing well", "feeling great", "all good", "i'm alright", "fine"
      ],
      "responses": [
        "That's wonderful to hear! Is there anything I can help you with today?",
        "I'm glad you're doing well! What can I assist you with?",
        "Great to hear that! How can I make your day even better?",
        "Excellent! Is there something you'd like to talk about or need help with?",
        "That's good news! I'm here if you need any assistance with anything."
      ]
    },
    {
      "tag": "user_feeling_hungry",
      "patterns": [
        "i'm hungry", "i need food", "i want to eat", "i'm starving",
        "need something to eat", "haven't eaten", "my stomach is growling"
      ],
      "responses": [
        "Food is important! Maybe it's time for a quick snack or meal?",
        "Being hungry can make it hard to focus. Perhaps take a break for a meal?",
        "I hope you can grab something to eat soon! Is there anything else I can help with?",
        "Sounds like it might be mealtime. I'd offer food if I could!",
        "I understand hunger can be distracting. Maybe you should pause our conversation for a quick bite?"
      ]
    },
    {
      "tag": "user_feeling_upset",
      "patterns": [
        "i'm upset", "i'm sad", "i'm not okay", "i feel down", "i'm depressed",
        "i'm feeling low", "i'm angry", "i'm frustrated", "i'm having a bad day",
        "i feel terrible", "i'm not doing well"
      ],
      "responses": [
        "I'm sorry to hear you're feeling that way. Would you like to talk about what's bothering you?",
        "That sounds difficult. Remember it's okay to take time for yourself when you're feeling down.",
        "I'm sorry you're going through this. Is there something specific that's troubling you?",
        "I wish I could help more. Sometimes sharing what's upsetting you can help, even a little.",
        "I'm here to listen if you want to talk about it. It's okay to not be okay sometimes."
      ]
    },
    {
      "tag": "user_feeling_tired",
      "patterns": [
        "i'm tired", "i'm exhausted", "i need sleep", "i'm sleepy",
        "i haven't slept", "i'm feeling fatigued", "no energy"
      ],
      "responses": [
        "Rest is important! Maybe take a short break if you can?",
        "Being tired can make everything harder. I hope you get a chance to rest soon.",
        "I understand how that feels. Don't forget to take care of yourself and get some rest when possible.",
        "Sometimes a short break or power nap can help refresh you. Your wellbeing is important!",
        "Taking care of your energy levels is essential. I hope you can find time to recharge soon."
      ]
    },
    {
      "tag": "user_feeling_bored",
      "patterns": [
        "i'm bored", "this is boring", "nothing to do", "need something to do",
        "looking for entertainment", "got any ideas", "entertain me"
      ],
      "responses": [
        "Looking for something to do? I could suggest a book, movie, or maybe help you learn something new!",
        "Boredom can sometimes be an opportunity. What kinds of activities do you usually enjoy?",
        "I could share a fun fact, suggest a creative project, or we could chat about a topic that interests you!",
        "Sometimes boredom means it's time to try something new! Any hobbies you've been wanting to explore?",
        "I can try to help with that! Would you like suggestions for activities, or maybe a brain teaser to solve?"
      ]
    },
    {
      "tag": "user_feeling_stressed",
      "patterns": [
        "i'm stressed", "i'm anxious", "i'm worried", "too much pressure",
        "feeling overwhelmed", "can't handle this", "too much going on"
      ],
      "responses": [
        "I'm sorry to hear you're feeling stressed. Taking a few deep breaths might help in the moment.",
        "Feeling overwhelmed is tough. Remember it's okay to take things one step at a time.",
        "Stress can be really difficult. Would talking about what's causing it help at all?",
        "Being stressed is challenging. Sometimes making a list or breaking things down into smaller tasks can help.",
        "I understand anxiety can be overwhelming. Remember to be kind to yourself during stressful times."
      ]
    },
    {
      "tag": "user_feeling_happy",
      "patterns": [
        "i'm happy", "i'm excited", "i'm cheerful", "having a great day",
        "feeling joy", "i'm delighted", "i feel amazing"
      ],
      "responses": [
        "That's wonderful to hear! Your happiness just brightened my day too!",
        "I'm so glad you're feeling happy! What's bringing you joy today?",
        "That's fantastic! Hold onto that feeling and enjoy every moment of it!",
        "Your happiness is contagious! I'm glad things are going well for you!",
        "That's great news! Is there something special that has you feeling so happy?"
      ]
      },

      {
        "tag": "question_how_you_feel",
        "patterns": [
          "how are you feeling",
          "how do you feel",
          "how you feel",
          "how you feeling",
          "you feeling okay",
          "you good",
          "you alright",
          "what's your mood"
        ],
        "responses": [
          "I'm feeling great!",
          "All systems go, I'm doing awesome!",
          "I'm running smoothly—thanks for asking!",
          "Feeling good and ready to help!",
          "Couldn't be better, what's up?"
        ]
      },

      {
        "tag": "statement_i_will_be_back",
        "patterns": [
          "I'll be back",
          "I will be back",
          "brb",
          "be right back",
          "gonna be back soon",
          "coming back soon"
        ],
        "responses": [
          "Alright, I'll be here when you get back!",
          "Take your time, I'll be waiting.",
          "No worries, see you soon!",
          "Come back soon—I’ll be ready!",
          "Got it. I'll hold down the fort!"
        ]
      },
      {
        "tag": "ask_for_advice",
        "patterns": [
          "can you give me advice",
          "I need help",
          "what should I do",
          "I'm not sure what to do",
          "give me some guidance"
        ],
        "responses": [
          "Let’s break it down—what’s on your mind?",
          "I’ll do my best to help. Tell me what’s going on.",
          "Sometimes a different perspective helps. Let’s figure it out together.",
          "Every situation has a path forward. Let’s find yours.",
          "You're stronger than you think. Let's tackle it step-by-step."
        ]
      },
      {
        "tag": "user_needs_motivation",
        "patterns": [
          "I need motivation",
          "motivate me",
          "I'm losing hope",
          "help me stay focused",
          "I feel like giving up"
        ],
        "responses": [
          "Even the strongest people have hard days—what matters is that you're still standing.",
          "You don’t need to see the whole path. Just take the next step.",
          "The fact that you're here, still trying, already makes you stronger than most.",
          "Great things take time. Storms don’t last forever—neither will this feeling.",
          "Let go of perfection and focus on progress. You're already further than yesterday.",
          "You weren’t made to quit. You were made to overcome.",
          "When everything feels like it's falling apart, it might be falling into place.",
          "You’ve survived 100% of your worst days. That’s not luck—it’s power."
        ]
      },
      {
        "tag": "fun_scientific_facts",
        "patterns": [
          "tell me a science fact",
          "say something scientific",
          "give me a fun fact",
          "drop some science",
          "hit me with knowledge",
          "blow my mind with science",
          "I want to learn something cool",
          "give me some science",
          "give fact",
          "give me facts",
          "facts"
        ],
        "responses": [
          "Did you know that octopuses have three hearts—and two of them stop beating when they swim?",
          "Bananas are naturally radioactive 🍌. They contain potassium-40, a radioactive isotope of potassium!",
          "If you could fold a piece of paper 42 times, it would reach the Moon. No joke—math is wild.",
          "There are more stars in the universe than grains of sand on all the Earth’s beaches... by a *lot*.",
          "Water can boil and freeze at the same time. It’s called the triple point, and it’s a physics party.",
          "On Saturn’s moon Titan, it rains methane. Like, actual gas rain. Space is metal.",
          "Your body has more bacterial cells than human ones. You're basically a walking ecosystem!",
          "The Eiffel Tower can grow over 6 inches taller in the summer due to thermal expansion.",
          "Sharks existed before trees. They've been around for over 400 million years.",
          "A teaspoon of a neutron star would weigh about 6 billion tons—more than every car on Earth combined.",
          "The human nose can detect over 1 trillion different scents. That’s a lot of sniffing power.",
          "Plants can ‘hear’ themselves being eaten. Some release chemicals in response to the sound.",
          "There’s enough DNA in your body to stretch from the Earth to the Sun and back—over 600 times.",
          "Lightning strikes can heat the air to 5 times hotter than the surface of the Sun.",
          "Sloths can hold their breath longer than dolphins—up to 40 minutes!",
          "Jellyfish are biologically immortal. They don’t die of old age—they just reset.",
          "Space isn’t completely silent. Astronauts have picked up ‘space sounds’ via electromagnetic vibrations.",
          "You’re taller in the morning than at night. Gravity compresses your spine throughout the day.",
          "The average cloud weighs over a million pounds—but floats because it’s less dense than air.",
          "Some fungi create their own wind by releasing water vapor to spread spores farther."
        ]
      }
    {
      "tag": "food_recommendations",
      "patterns": [
        "what should I eat?", "recommend me food", "I'm hungry what should I get",
        "food ideas", "dinner suggestions", "lunch recommendations",
        "what's good to eat?", "best food near me", "what to cook?",
        "recipe ideas", "what's for dinner?", "food inspiration",
        "breakfast ideas", "healthy meal options", "quick meal ideas"
      ],
      "responses": [
        "I can't know what's available near you, but some popular options might be pizza, pasta, or a sandwich!",
        "How about trying something new today? Maybe Thai food or Mediterranean cuisine?",
        "A balanced meal with protein, vegetables, and healthy carbs is always a good choice!",
        "If you're looking for something quick, salads, wraps, or stir-fries are great options.",
        "How about a hearty soup or stew? They're nutritious and satisfying!",
        "Breakfast for dinner is always fun - perhaps some eggs, toast, and fruit?",
        "If you're in the mood to cook, a simple pasta dish with vegetables could be quick and delicious.",
        "Maybe a build-your-own bowl with grains, protein, veggies, and a tasty sauce?",
        "I don't know what's available to you, but tacos are always a good idea!",
        "How about a homemade pizza with your favorite toppings?"
      ]
    },
    {
      "tag": "health_advice",
      "patterns": [
        "how to be healthy", "health tips", "fitness advice",
        "how to lose weight", "how to gain muscle", "healthy habits",
        "wellness tips", "nutrition advice", "workout recommendations",
        "how to sleep better", "mental health tips", "how to stay fit",
        "diet advice", "exercise recommendations", "healthy lifestyle"
      ],
      "responses": [
        "Some basic health tips include regular exercise, balanced nutrition, adequate sleep, and staying hydrated.",
        "For general wellness, try to incorporate 30 minutes of movement daily, eat plenty of vegetables, limit processed foods, and prioritize sleep.",
        "Remember that health involves both physical and mental wellbeing. Consider activities that support both, like walking in nature or yoga.",
        "Small sustainable changes often work better than drastic ones. Maybe start with drinking more water or taking short walking breaks.",
        "For better sleep, consider establishing a regular sleep schedule, limiting screen time before bed, and creating a comfortable sleep environment.",
        "Balance is key to a healthy lifestyle - work, rest, nutrition, exercise, and social connections all play important roles.",
        "Remember that specific health advice should come from healthcare professionals who know your personal situation.",
        "General wellness practices include staying hydrated, eating a variety of whole foods, moving regularly, and managing stress.",
        "For mental wellbeing, consider mindfulness practices, connecting with others, and seeking professional support when needed.",
        "Remember that health looks different for everyone - what works best depends on your unique body and circumstances."
      ]
    },
    {
      "tag": "book_recommendations",
      "patterns": [
        "recommend a book", "good books to read", "what should I read next",
        "best novels", "book suggestions", "popular books",
        "classic books", "fiction recommendations", "non-fiction books",
        "what are you reading", "must-read books", "book recommendations",
        "favorite books", "recommend an author", "literary suggestions"
      ],
      "responses": [
        "Some popular books include 'The Alchemist' by Paulo Coelho, '1984' by George Orwell, and 'To Kill a Mockingbird' by Harper Lee.",
        "If you enjoy fantasy, classics like 'The Lord of the Rings' or more recent works like 'The Name of the Wind' are highly regarded.",
        "For non-fiction, 'Sapiens' by Yuval Noah Harari and 'Thinking, Fast and Slow' by Daniel Kahneman are fascinating reads.",
        "Classic literature like 'Pride and Prejudice,' 'Great Expectations,' and 'The Great Gatsby' have stood the test of time.",
        "If you enjoy mysteries, authors like Agatha Christie, Arthur Conan Doyle, and modern writers like Gillian Flynn are worth exploring.",
        "Science fiction fans might enjoy 'Dune' by Frank Herbert, 'The Three-Body Problem' by Liu Cixin, or works by Ted Chiang.",
        "For personal development, books like 'Atomic Habits' by James Clear or 'Mindset' by Carol Dweck are popular choices.",
        "If you're interested in memoirs, 'Educated' by Tara Westover and 'Born a Crime' by Trevor Noah are compelling reads.",
        "For fantasy readers, 'The Fifth Season' by N.K. Jemisin or 'Mistborn' by Brandon Sanderson offer immersive worlds.",
        "Historical fiction like 'All the Light We Cannot See' or 'The Book Thief' blend compelling stories with historical contexts."
      ]
    },
    {
      "tag": "movie_recommendations",
      "patterns": [
        "recommend a movie", "what movie should I watch", "good films",
        "best movies", "movie suggestions", "film recommendations",
        "what's a good film", "movie night ideas", "must-see movies",
        "classic films", "popular movies", "what to watch", "netflix recommendations", 
        "recommend a film", "what should I watch tonight"
      ],
      "responses": [
        "Classic films like 'The Godfather,' 'Casablanca,' and 'The Shawshank Redemption' are always worth watching!",
        "For science fiction fans, movies like 'Inception,' 'Arrival,' or 'Blade Runner' offer thought-provoking stories.",
        "If you enjoy comedies, films like 'The Grand Budapest Hotel,' 'Superbad,' or 'Bridesmaids' might be good choices.",
        "For drama and emotional depth, movies like 'The Pursuit of Happyness,' 'Manchester by the Sea,' or 'Moonlight' are powerful.",
        "Animation isn't just for kids - films like 'Spider-Man: Into the Spider-Verse,' 'Your Name,' and Studio Ghibli works are incredible.",
        "For thriller fans, movies like 'Get Out,' 'Parasite,' or 'The Silence of the Lambs' offer suspense and surprise.",
        "Fantasy adventures like the Lord of the Rings trilogy, 'Pan's Labyrinth,' or 'The Princess Bride' transport viewers to other worlds.",
        "For documentaries, 'My Octopus Teacher,' '13th,' or 'Free Solo' cover fascinating topics with real-world impact.",
        "Romance films like 'Before Sunrise,' 'The Notebook,' or 'Eternal Sunshine of the Spotless Mind' explore different aspects of love.",
        "Historical dramas such as 'Schindler's List,' '12 Years a Slave,' or 'The King's Speech' bring important stories to life."
      ]
    },
    {
      "tag": "music_recommendations",
      "patterns": [
        "recommend music", "good songs", "what should I listen to",
        "music suggestions", "playlist ideas", "best albums",
        "favorite songs", "music to study to", "workout music",
        "relaxing music", "new music", "music recommendations",
        "what's good music", "bands to check out", "popular songs"
      ],
      "responses": [
        "Music is very personal, but some timeless artists include The Beatles, Queen, and Michael Jackson.",
        "For studying or focus, instrumental music like lo-fi beats, classical composers like Mozart, or ambient artists like Brian Eno might help.",
        "If you're looking for workout motivation, upbeat genres like EDM, hip-hop, or rock often have good energy.",
        "For relaxation, artists like Bon Iver, Norah Jones, or ambient composers like Max Richter create calming atmospheres.",
        "Jazz legends like Miles Davis, John Coltrane, and Ella Fitzgerald offer rich musical experiences worth exploring.",
        "For something contemporary, artists like Kendrick Lamar, Billie Eilish, and Taylor Swift have critically acclaimed work.",
        "Classical music offers incredible variety - from the energy of Beethoven to the emotion of Chopin.",
        "If you enjoy rock, bands like Radiohead, Arctic Monkeys, and Tame Impala span different styles within the genre.",
        "For electronic music, artists like Daft Punk, Bonobo, and Four Tet create innovative soundscapes.",
        "World music offers amazing diversity - from the rhythms of Afrobeat to the melodies of Indian classical music."
      ]
    },
    {
      "tag": "travel_suggestions",
      "patterns": [
        "where should I travel", "vacation ideas", "best places to visit", 
        "travel recommendations", "tourist destinations", "places to see",
        "travel bucket list", "weekend getaway ideas", "best countries to visit",
        "travel suggestions", "where to go on vacation", "best cities to visit",
        "international travel ideas", "where to travel", "holiday destinations"
      ],
      "responses": [
        "Popular destinations include cities like Paris, Tokyo, and New York, each offering unique cultures and experiences.",
        "For natural beauty, places like Iceland, New Zealand, and Costa Rica offer breathtaking landscapes and outdoor adventures.",
        "If you enjoy history, cities like Rome, Athens, and Kyoto have preserved remarkable historical sites and architecture.",
        "Beach destinations like the Maldives, Thailand's islands, and Mexico's coastlines offer relaxation and stunning waters.",
        "For unique cultural experiences, countries like Japan, Morocco, and India offer rich traditions and diverse perspectives.",
        "If you prefer off-the-beaten-path destinations, consider places like Georgia (the country), Slovenia, or Uruguay.",
        "Food-focused travelers often enjoy destinations like Italy, Vietnam, and Spain for their culinary traditions.",
        "Adventure seekers might consider hiking in Patagonia, safari in Tanzania, or exploring the Amazon rainforest.",
        "For budget-friendly options, countries like Portugal, Thailand, and Mexico offer great experiences at lower costs.",
        "Sometimes the best trips are closer to home - consider exploring nearby natural parks, small towns, or cities you haven't visited."
      ]
    },
    {
      "tag": "pet_advice",
      "patterns": [
        "pet advice", "dog training tips", "cat behavior", "how to care for pets", 
        "pet health questions", "new pet owner advice", "pet food recommendations",
        "pet adoption tips", "best pets for apartments", "pet training help",
        "how to take care of a fish", "bird care tips", "reptile care", 
        "pet behavior problems", "how to choose a pet"
      ],
      "responses": [
        "Regular veterinary checkups are essential for all pets, along with proper nutrition, exercise, and affection.",
        "When training dogs, consistency, positive reinforcement, and patience are key elements for success.",
        "Cats generally need scratching posts, clean litter boxes, interactive toys, and high perches to be happy.",
        "New pet owners should research the specific needs of their pet's species and breed before bringing them home.",
        "Different pets have different exercise needs - dogs typically need daily walks, while cats benefit from play sessions.",
        "When choosing pet food, look for options appropriate for your pet's age, size, and any special health considerations.",
        "Pet-proofing your home is important - remove toxic plants, secure cords, and eliminate access to harmful substances.",
        "For apartment dwellers, cats, small dogs, fish, and certain reptiles often adapt well to smaller living spaces.",
        "Most pets benefit from mental stimulation - training, puzzle toys, and new experiences help prevent boredom.",
        "Remember that pets are a long-term commitment - some may live 10-20 years or more, requiring consistent care."
      ]
    },
    {
      "tag": "career_advice",
      "patterns": [
        "career advice", "job hunting tips", "how to find a job", "resume help",
        "interview tips", "career change advice", "how to ask for a raise",
        "job search strategies", "career development", "professional growth",
        "how to get promoted", "workplace advice", "job application tips",
        "career path suggestions", "profession recommendations"
      ],
      "responses": [
        "When job hunting, leverage your network, customize your resume for each application, and prepare thoroughly for interviews.",
        "For career growth, seek feedback regularly, develop in-demand skills, and look for opportunities to take on new responsibilities.",
        "When considering a career change, assess your transferable skills, research new fields thoroughly, and consider informational interviews.",
        "Effective resumes highlight achievements rather than just responsibilities and are tailored to match the job description.",
        "During interviews, prepare specific examples that demonstrate your skills, research the company, and prepare thoughtful questions to ask.",
        "Professional development can include formal education, certifications, mentorship, and self-directed learning.",
        "When negotiating salary, research industry standards, highlight your value to the organization, and practice your talking points.",
        "Building a personal brand through networking, social media presence, and thought leadership can create new opportunities.",
        "Work-life balance is crucial for long-term career success - set boundaries and make time for rest and personal interests.",
        "Remember that career paths are rarely linear today - be open to lateral moves, new skills, and unexpected opportunities."
      ]
    },
    {
      "tag": "tech_help",
      "patterns": [
        "computer problems", "tech support", "how to fix my phone", 
        "wifi not working", "software recommendations", "computer running slow",
        "best apps for", "how to back up data", "printer issues",
        "tech troubleshooting", "device not turning on", "password help",
        "how to update", "tech advice", "computer virus help"
      ],
      "responses": [
        "For many tech issues, the first step is to try restarting your device completely.",
        "If your computer is running slowly, try closing unnecessary programs, clearing temporary files, and checking for malware.",
        "WiFi problems can often be resolved by restarting your router, checking for interference, or repositioning the router.",
        "For smartphone issues, ensure your operating system is updated, close background apps, and manage your storage space.",
        "To keep your data safe, regularly back up to both cloud services and physical devices like external hard drives.",
        "Password managers can help you create and store strong, unique passwords for all your accounts securely.",
        "If a device won't turn on, check power connections, try a different outlet, and ensure batteries are charged if applicable.",
        "For printer issues, check connections, restart both printer and computer, and ensure you have updated drivers installed.",
        "When experiencing software problems, check for updates, reinstall the application, or contact the developer's support team.",
        "If you suspect a computer virus, run a reputable antivirus scan, avoid clicking suspicious links, and consider consulting an IT professional."
      ]
    },
    {
      "tag": "relationship_advice",
      "patterns": [
        "relationship advice", "dating tips", "how to improve marriage",
        "communication in relationships", "how to find love", "breakup advice",
        "friendship problems", "family conflict", "relationship problems",
        "how to apologize", "long distance relationship tips", "trust issues",
        "relationship red flags", "healthy boundaries", "conflict resolution"
      ],
      "responses": [
        "Healthy relationships generally involve open communication, mutual respect, trust, and maintaining individual identities.",
        "When conflicts arise, try to listen actively, use 'I' statements to express feelings, and focus on the issue rather than assigning blame.",
        "Building trust requires consistency, honesty, reliability, and respecting boundaries over time.",
        "For relationship problems, consider whether both parties are willing to work on issues and possibly seek professional guidance.",
        "Long-distance relationships benefit from regular communication, visits when possible, shared activities, and clear expectations.",
        "Red flags in relationships may include controlling behavior, disrespect, dishonesty, and patterns of breaking promises.",
        "A sincere apology typically acknowledges the specific harm caused, expresses genuine remorse, and commits to different behavior.",
        "Healthy boundaries involve clearly communicating your needs and limits while respecting those of others.",
        "Remember that all relationships require ongoing effort, adaptation, and willingness to grow together.",
        "If you're looking for a partner, focus on activities you enjoy and building a fulfilling life - this helps you meet compatible people."
      ]
    },
    {
      "tag": "education_advice",
      "patterns": [
        "study tips", "learning strategies", "education advice", "college recommendations",
        "how to focus on studying", "best ways to learn", "school help",
        "online course recommendations", "degree advice", "learning resources",
        "homework help", "education paths", "best universities", 
        "scholarship information", "student advice"
      ],
      "responses": [
        "Effective studying often involves active recall, spaced repetition, teaching concepts to others, and applying knowledge practically.",
        "For better focus while studying, consider the Pomodoro Technique, minimizing distractions, and having a dedicated study space.",
        "When choosing educational paths, consider your interests, strengths, career goals, and learning style preferences.",
        "Online learning resources include platforms like Coursera, Khan Academy, edX, and YouTube educational channels.",
        "Learning new skills often works best with consistent practice, getting feedback, and connecting new information to existing knowledge.",
        "For college selection, consider factors like programs offered, location, size, culture, cost, and available support services.",
        "Scholarship opportunities may be available through schools, private organizations, employers, and government programs.",
        "Different learning styles might benefit from varied approaches - visual aids, discussions, hands-on practice, or written materials.",
        "Time management is crucial for students - tools like calendars, priority lists, and breaking down large projects can help.",
        "Remember that education is a lifelong journey - formal degrees, self-directed learning, and experience all contribute to knowledge."
      ]
    },
    {
      "tag": "financial_advice",
      "patterns": [
        "money advice", "financial tips", "how to save money", "investment advice",
        "budgeting help", "debt reduction", "financial planning", "retirement savings",
        "how to make money", "credit score improvement", "frugal living tips",
        "financial goals", "money management", "saving for home", "emergency fund"
      ],
      "responses": [
        "Basic financial planning typically starts with budgeting, building an emergency fund, managing debt, and then saving for goals.",
        "For budgeting, track your expenses, distinguish between needs and wants, and look for areas where you can reduce spending.",
        "An emergency fund ideally covers 3-6 months of essential expenses and should be kept in an accessible account.",
        "When reducing debt, consider strategies like paying off highest-interest debt first or building momentum with smaller balances.",
        "For retirement planning, take advantage of employer matches, tax-advantaged accounts, and the power of compound interest over time.",
        "Financial goals are more achievable when they're specific, measurable, achievable, relevant, and time-bound (SMART).",
        "To improve your credit score, pay bills on time, reduce debt, don't close old accounts, and check your credit report for errors.",
        "When looking to increase income, consider skill development, side hustles, negotiating salary, or exploring new career opportunities.",
        "For major purchases like homes, save for a down payment, understand all costs involved, and ensure it fits your long-term budget.",
        "Remember that financial advice should be adjusted for your personal situation and goals - what works for others may not work for you."
      ]
    },
    {
      "tag": "hobby_suggestions",
      "patterns": [
        "hobby ideas", "new hobbies", "what hobby should I try", "fun activities",
        "hobby suggestions", "creative hobbies", "outdoor hobbies", "indoor activities",
        "weekend activity ideas", "cheap hobbies", "interesting pastimes",
        "hobby recommendations", "things to do in free time", "productive hobbies", "skills to learn"
      ],
      "responses": [
        "Creative hobbies include drawing, writing, photography, knitting, playing musical instruments, and cooking or baking.",
        "For outdoor enthusiasts, consider hiking, gardening, birdwatching, cycling, kayaking, or photography.",
        "Indoor hobbies might include reading, puzzles, board games, cooking, home brewing, or learning a new language.",
        "If you enjoy technology, you might like coding, 3D printing, digital art, video editing, or building computers.",
        "Physical hobbies like dance, martial arts, yoga, or recreational sports can be both fun and good for health.",
        "Collecting can be fascinating - whether it's books, records, stamps, rocks, vintage items, or art.",
        "Crafting hobbies include woodworking, pottery, jewelry making, candle making, or upcycling old items.",
        "For social connection, consider joining a book club, community theater, volunteer group, or recreational sports team.",
        "Learning-focused hobbies might include studying history, astronomy, botany, or exploring philosophy.",
        "Budget-friendly options include hiking, reading (with library access), drawing, writing, or learning through free online resources."
      ]
    },
    {
      "tag": "cooking_advice",
      "patterns": [
        "cooking tips", "recipe help", "how to cook", "baking advice",
        "kitchen hacks", "food preparation", "beginner cooking", "cooking techniques",
        "how to make", "best way to cook", "recipe ideas", "cooking basics",
        "meal prep advice", "how to bake", "cooking questions"
      ],
      "responses": [
        "For beginners, start with simple recipes with few ingredients and build your skills gradually.",
        "Reading a recipe completely before starting helps avoid surprises and ensures you have all necessary ingredients and equipment.",
        "Basic knife skills can transform your cooking - learn proper chopping, dicing, and mincing techniques for safety and efficiency.",
        "Invest in a few quality tools rather than many mediocre ones - a good chef's knife, cutting board, and skillet are essentials.",
        "Understanding basic techniques like sautéing, roasting, and simmering gives you flexibility beyond specific recipes.",
        "Salt and acid (like lemon juice or vinegar) can balance and enhance flavors - taste as you go and adjust accordingly.",
        "For baking, measuring ingredients precisely is important, while cooking savory dishes often allows more flexibility.",
        "Prep ingredients before starting to cook (mise en place) makes the cooking process smoother and less stressful.",
        "Don't be afraid of mistakes - they're how you learn and develop your cooking intuition.",
        "Fresh herbs, spices, and aromatics like garlic and onions can elevate simple dishes with minimal effort."
      ]
    },
    {
      "tag": "sleep_problems",
      "patterns": [
        "can't sleep", "insomnia help", "how to fall asleep", "trouble sleeping",
        "sleep better", "sleep advice", "night routine", "sleep quality",
        "falling asleep fast", "sleep tips", "sleeping problems", 
        "sleep disorder", "better sleep", "sleep schedule", "wake up rested"
      ],
      "responses": [
        "Establishing a consistent sleep schedule, even on weekends, helps regulate your body's internal clock.",
        "Create a restful environment by keeping your bedroom cool, quiet, and dark, with comfortable bedding.",
        "Limit exposure to screens (phones, computers, TVs) at least 1-2 hours before bedtime due to blue light effects.",
        "Avoid caffeine late in the day and be mindful that alcohol, while sometimes making you drowsy, often disrupts sleep quality.",
        "Regular physical activity can promote better sleep, though try not to exercise too close to bedtime.",
        "Relaxing bedtime routines like reading, gentle stretching, or meditation can signal to your body it's time to wind down.",
        "If you can't fall asleep within about 20 minutes, try getting up and doing something relaxing until you feel tired.",
        "Managing stress through techniques like journaling, meditation, or organizing your next day's tasks can help quiet a busy mind.",
        "For persistent sleep problems, consider consulting a healthcare provider as they could indicate underlying issues.",
        "Natural light exposure during the day and darkness at night helps maintain your circadian rhythm for better sleep."
      ]
    },
    {
      "tag": "apology",
      "patterns": [
        "I'm sorry", "sorry about that", "my apologies", "I apologize",
        "didn't mean to", "sorry for", "regret that", "my bad",
        "pardon me", "excuse me", "forgive me", "apologize for"
      ],
      "responses": [
        "No need to apologize!",
        "That's completely okay!",
        "No problem at all!",
        "Don't worry about it!",
        "No apology necessary!",
        "It's fine, really!",
        "No need for apologies.",
        "Think nothing of it!",
        "We're all good!",
        "Not a problem at all."
      ]
    },
    {
      "tag": "emergency_help",
      "patterns": [
        "help emergency", "medical emergency", "call 911", "need ambulance",
        "heart attack", "stroke symptoms", "severe bleeding", "choking help",
        "emergency response", "first aid", "critical situation", "urgent help needed",
        "emergency services", "life threatening", "immediate medical attention"
      ],
      "responses": [
        "For a medical emergency, please call emergency services (like 911 in the US) immediately rather than chatting here.",
        "This sounds urgent - please contact emergency services immediately. In many countries, that's 911, 999, or 112.",
        "Please call emergency services right away. I'm not able to provide emergency assistance.",
        "For any life-threatening situation, please call your local emergency number immediately.",
        "Medical emergencies require immediate professional help. Please call emergency services now.",
        "Please stop messaging and call emergency services immediately if you're experiencing a medical emergency.",
        "I can't provide emergency services. Please call your local emergency number right away.",
        "Emergency situations require immediate professional response. Please contact emergency services, not an AI assistant.",
        "For emergencies, please contact professional emergency services immediately. Every moment counts.",
        "Please call emergency services now if you or someone else needs urgent medical attention."
      ]
    },
    {
      "tag": "gaming_recommendations",
      "patterns": [
        "game recommendations", "video game suggestions", "what games to play",
        "best video games", "pc game recommendations", "mobile games",
        "console games", "gaming suggestions", "popular games",
        "indie games", "game advice", "fun games", "what should I play",
        "new games", "gaming recommendations"
      ],
      "responses": [
        "Popular games with broad appeal include Minecraft, The Legend of Zelda series, and Animal Crossing.",
        "If you enjoy narrative-focused games, try titles like The Last of Us, Red Dead Redemption 2, or Life is Strange.",
        "For competitive gaming, popular options include League of Legends, Valorant, Overwatch, and fighting games like Street Fighter.",
        "Indie games often offer unique experiences - titles like Hades, Hollow Knight, and Stardew Valley are highly regarded.",
        "Strategy fans might enjoy Civilization, XCOM, or real-time strategy games like StarCraft.",
        "For mobile gaming, games like Monument Valley, Among Us, and Genshin Impact offer different types of experiences.",
        "Role-playing game fans might enjoy series like Final Fantasy, The Elder Scrolls, or The Witcher.",
        "If you enjoy puzzle games, Portal, The Witness, and Baba Is You offer creative challenges.",
        "Horror game enthusiasts might appreciate titles like Resident Evil, Dead Space, or indie horror games like Phasmophobia.",
        "For relaxing gameplay, consider simulation games like The Sims, Cities: Skylines, or casual games like Unpacking."
      ]
    },
    {
      "tag": "small_talk_weather",
      "patterns": [
        "it's raining today", "beautiful day", "it's cold outside", "snowing here",
        "weather is nice", "it's hot today", "weather is terrible", "sunny day",
        "terrible weather", "it's cloudy", "weather's perfect", "stormy here",
        "nice day today", "freezing outside", "hot outside"
      ],
      "responses": [
        "Weather can really affect our mood, can't it? How does today's weather make you feel?",
        "I hope you're staying comfortable whatever the weather is like!",
        "Weather is always changing - sometimes for better, sometimes for worse!",
        "The weather certainly adds character to our days. Is it affecting your plans?",
        "There's something special about each type of weather, though some are certainly more pleasant than others!",
        "Weather talk - the universal conversation starter! What's your favorite kind of weather?",
        "I hope the weather is treating you well! Do you have any weather-dependent plans?",
        "Weather can be so unpredictable sometimes. Hope it's working in your favor!",
        "They say there's no bad weather, just inappropriate clothing - though I'm not sure everyone would agree!",
        "Weather certainly keeps life interesting, doesn't it? Always changing and surprising us!"
      ]
    },
    {
      "tag": "good_morning",
      "patterns": [
        "good morning", "morning", "rise and shine", "up and at em",
        "morning greetings", "hello morning", "top of the morning", 
        "morning there", "woke up", "just got up", "early morning"
      ],
      "responses": [
        "Good morning! How are you starting your day?",
        "Morning! Hope you're having a bright start to your day!",
        "Good morning! Ready to make today amazing?",
        "Hello and good morning! What's on your agenda today?",
        "Morning! Hope you slept well and are ready for the day ahead!",
        "Good morning! May your coffee be strong and your day be productive!",
        "Rise and shine! How's your morning going so far?",
        "Good morning! Starting the day with some positive energy?",
        "Morning there! Hope today brings you wonderful things!",
        "Good morning! What's the first thing on your to-do list today?"
      ]
    },
    {
      "tag": "good_night",
      "patterns": [
        "good night", "night", "heading to bed", "going to sleep",
        "time for bed", "sleep well", "sweet dreams", "goodnight",
        "nighty night", "sleep tight", "off to bed", "bedtime"
      ],
      "responses": [
        "Good night! Sleep well and sweet dreams!",
        "Night! Hope you get some restful sleep!",
        "Good night! May tomorrow bring even better things your way!",
        "Sleep tight! Hope to chat with you again soon!",
        "Good night! Rest well and recharge for tomorrow!",
        "Sweet dreams! Looking forward to our next conversation!",
        "Good night! Thank you for chatting today!",
        "Night night! Hope you have a peaceful sleep!",
        "Good night! May your dreams be pleasant and your sleep refreshing!",
        "Rest well! Until next time!"
      ]
    },
    {
      "tag": "goal_setting",
      "patterns": [
        "how to set goals", "goal setting advice", "achieve my goals",
        "setting objectives", "smart goals", "goal planning",
        "how to reach goals", "personal goals", "accomplishing aims",
        "goal setting tips", "effective goals", "goal strategies"
      ],
      "responses": [
        "Effective goals are often SMART: Specific, Measurable, Achievable, Relevant, and Time-bound.",
        "Break larger goals into smaller milestones to make progress more manageable and visible.",
        "Writing down your goals makes them more concrete and increases your commitment to achieving them.",
        "Consider your values and what truly matters to you when setting goals to ensure they're meaningful.",
        "Regular review and adjustment of goals helps keep them relevant as circumstances change.",
        "Balance is important - set goals across different life areas like health, relationships, career, and personal growth.",
        "Accountability can help - consider sharing goals with someone supportive or finding an accountability partner.",
        "Celebrate progress and small wins along the way to maintain motivation and momentum.",
        "Be kind to yourself if progress is slower than expected - persistence often matters more than speed.",
        "Remember that goals are tools to guide your growth and choices, not rigid demands that define your worth."
      ]
    }
  ]
}
